In [1]:
import pandas as pd

In [2]:
var= pd.DataFrame({"A":[1,2,3,4],
                   "B":[5,6,7,8],
                  "C":[15,16,17,18],
                  "D":[45,46,47,88]})
var

   A  B   C   D
0  1  5  15  45
1  2  6  16  46
2  3  7  17  47
3  4  8  18  88

In [3]:
var["python_12"]=var["C"][:2]
var

   A  B   C   D  python_12
0  1  5  15  45       15.0
1  2  6  16  46       16.0
2  3  7  17  47        NaN
3  4  8  18  88        NaN

In [4]:
var

   A  B   C   D  python_12
0  1  5  15  45       15.0
1  2  6  16  46       16.0
2  3  7  17  47        NaN
3  4  8  18  88        NaN

In [5]:
var1=var.pop("B")
var1

0    5
1    6
2    7
3    8
Name: B, dtype: int64

In [6]:
var.insert(2,"python_1",[81,82,83,84])
var

   A   C  python_1   D  python_12
0  1  15        81  45       15.0
1  2  16        82  46       16.0
2  3  17        83  47        NaN
3  4  18        84  88        NaN

In [29]:
del var["A"]

In [7]:
var

   A   C  python_1   D  python_12
0  1  15        81  45       15.0
1  2  16        82  46       16.0
2  3  17        83  47        NaN
3  4  18        84  88        NaN